CSI API ETABS v1
cCaseStaticNonlinearStaged.SetMaterialNonlinearity Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetMaterialNonlinearity(
	string Name,
	bool TimeDepMatProp
)
Function SetMaterialNonlinearity (
	Name As String,
	TimeDepMatProp As Boolean
) As Integer
Dim instance As cCaseStaticNonlinearStaged
Dim Name As String
Dim TimeDepMatProp As Boolean
Dim returnValue As Integer
returnValue = instance.SetMaterialNonlinearity(Name,
	TimeDepMatProp)
int SetMaterialNonlinearity(
	String^ Name,
	bool TimeDepMatProp
)
abstract SetMaterialNonlinearity :
        Name : string *
        TimeDepMatProp : bool -> int
Parameters
Name
Type: System.String
TimeDepMatProp
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinearStaged Interface
ETABSv1 Namespace